Revit 2027 API
BuiltInFailures.FormFailures.FormElemRegenSelfIntersectionReorderProfiles Property
 This form cannot be created due to self-intersecting geometry. Clicking the Reorder Profiles button will attempt to solve this problem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FormElemRegenSelfIntersectionReorderProfiles { get; }
Public Shared ReadOnly Property FormElemRegenSelfIntersectionReorderProfiles As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FormElemRegenSelfIntersectionReorderProfiles {
	FailureDefinitionId^ get ();
}
static member FormElemRegenSelfIntersectionReorderProfiles : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FormFailures Class
Autodesk.Revit.DB Namespace